---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.SetCutLayerModifiers(System.Collections.Generic.IList{Autodesk.Revit.DB.LayerModifier})
source: html/4ef6ca58-8a68-31ff-b9e0-8f69c85642c3.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.SetCutLayerModifiers Method

Sets a cut layer modifier array to the layer info.

## Syntax (C#)
```csharp
public void SetCutLayerModifiers(
	IList<LayerModifier> cutLayermodifiers
)
```

## Parameters
- **cutLayermodifiers** (`System.Collections.Generic.IList < LayerModifier >`) - The cut layer modifier array.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null